Gym/GYM/GYMci4/app/Controllers/GymCustomer.php

	 public function listRecord()
    {
        $GymCustomerModel = new GymCustomerModel();
        $data['CustomerData'] = $GymCustomerModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `customer`
ORDER BY `id` DESC