Gym/GYM/GYMci4/app/Controllers/Machinery.php

 public function listRecord()
    {
        $MachineModel = new MachineModel();
        $data['MachineData'] = $MachineModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `machine`
ORDER BY `id` DESC

	  public function edit($id = null)
	 {
		 $MachineModel = new MachineModel();
        $data['editData'] = $MachineModel->where('id', $id)->first();
---
SELECT *
FROM `machine`
WHERE `id` = '4'
 LIMIT 1

						  'renewdate' => $renewdate,
						  'depreciation' => $depreciation,
			 ];
			$MachineModel->update($id, $update_data);
---
UPDATE `machine` SET `machinename` = 'bar', `machineno` = '342165', `brand` = 'abc', `branchname` = '', `purchasecost` = '20000', `date` = '2022-02-15', `machinetype` = ' Select Machine Type', `purchasetype` = ' Select Purchase Type', `purchaseno` = '432', `insurance` = 'Have Insurance', `insuranceno` = '43216', `insurancename` = 'abc', `purchasedate` = '2022-02-26', `renewdate` = '2022-03-12', `depreciation` = '10%'
WHERE `machine`.`id` IN ('4')